import { FC } from "react";
import {
  ContentWrapper,
  PageHeading,
  PageList,
  PageListTitle,
  SectionContainer,
} from "@/components/layout";
import PageListItem from "../layout/markup/PageListItem.tsx";

const Agreement: FC = () => {
  return (
    <ContentWrapper>
      <SectionContainer>
        <PageHeading>Договор оферты</PageHeading>
        <PageList>
          <PageListTitle>
            1. Идейные соображения высшего порядка, а также высокое качество
            позиционных исследований представляет собой интересный эксперимент
            проверки экспериментов, поражающих по своей масштабности и
            грандиозности.
          </PageListTitle>
          <PageListItem>
            1.1. Задача организации, в особенности же социально-экономическое
            развитие однозначно определяет каждого участника как способного
            принимать собственные решения касаемо инновационных методов
            управления процессами.
          </PageListItem>
          <PageListItem>
            1.2. Не следует, однако, забывать, что разбавленное изрядной долей
            эмпатии, рациональное мышление играет важную роль в формировании
            приоритизации разума над эмоциями. Но некоторые особенности
            внутренней политики лишь добавляют фракционных разногласий и преданы
            социально-демократической анафеме.
          </PageListItem>
          <PageListItem>
            1.3. Приятно, граждане, наблюдать, как элементы политического
            процесса, превозмогая сложившуюся непростую экономическую ситуацию,
            объявлены нарушающими общечеловеческие нормы этики и морали.
          </PageListItem>
          <PageListItem>
            1.4. Но независимые государства, которые представляют собой яркий
            пример континентально-европейского типа политической культуры, будут
            объединены в целые кластеры себе подобных.
          </PageListItem>
        </PageList>

        <PageList>
          <PageListTitle>
            2. С учётом сложившейся международной обстановки, консультация с
            широким активом предоставляет широкие возможности для приоритизации
            разума над эмоциями.
          </PageListTitle>
          <PageListItem>
            2.1. Задача организации, в особенности же социально-экономическое
            развитие однозначно определяет каждого участника как способного
            принимать собственные решения касаемо инновационных методов
            управления процессами.
          </PageListItem>
          <PageListItem leftOffset="medium">
            2.1.1. Не следует, однако, забывать, что разбавленное изрядной долей
            эмпатии, рациональное мышление играет важную роль в формировании
            приоритизации разума над эмоциями. Но некоторые особенности
            внутренней политики лишь добавляют фракционных разногласий и преданы
            социально-демократической анафеме.
          </PageListItem>
          <PageListItem leftOffset="medium">
            2.1.2. Приятно, граждане, наблюдать, как элементы политического
            процесса, превозмогая сложившуюся непростую экономическую ситуацию,
            объявлены нарушающими общечеловеческие нормы этики и морали.
          </PageListItem>
          <PageListItem>
            2.2. Но независимые государства, которые представляют собой яркий
            пример континентально-европейского типа политической культуры, будут
            объединены в целые кластеры себе подобных.
          </PageListItem>
        </PageList>

        <PageList>
          <PageListTitle>
            3. Принимая во внимание показатели успешности, укрепление и развитие
            внутренней структуры требует от нас анализа приоритизации разума над
            эмоциями.
          </PageListTitle>
          <PageListItem>
            3.1. Задача организации, в особенности же социально-экономическое
            развитие однозначно определяет каждого участника как способного
            принимать собственные решения касаемо инновационных методов
            управления процессами.
          </PageListItem>
          <PageListItem leftOffset="medium">
            3.1.1. Не следует, однако, забывать, что разбавленное изрядной долей
            эмпатии, рациональное мышление играет важную роль в формировании
            приоритизации разума над эмоциями. Но некоторые особенности
            внутренней политики лишь добавляют фракционных разногласий и преданы
            социально-демократической анафеме.
          </PageListItem>
          <PageListItem leftOffset="medium">
            3.1.2. Приятно, граждане, наблюдать, как элементы политического
            процесса, превозмогая сложившуюся непростую экономическую ситуацию,
            объявлены нарушающими общечеловеческие нормы этики и морали.
          </PageListItem>
          <PageListItem>
            3.2. Но независимые государства, которые представляют собой яркий
            пример континентально-европейского типа политической культуры, будут
            объединены в целые кластеры себе подобных.
          </PageListItem>
          <PageListItem>
            3.3. Не следует, однако, забывать, что экономическая повестка
            сегодняшнего дня требует анализа анализа существующих паттернов
            поведения.
          </PageListItem>
          <PageListItem leftOffset="medium">
            3.3.1. А ещё представители современных социальных резервов набирают
            популярность среди определенных слоев населения, а значит, должны
            быть функционально разнесены на независимые элементы.
          </PageListItem>
          <PageListItem leftOffset="large">
            3.3.1.1. Стремящиеся вытеснить традиционное производство,
            нанотехнологии могут быть объявлены нарушающими общечеловеческие
            нормы этики и морали.
          </PageListItem>
          <PageListItem leftOffset="large">
            3.3.1.2. Прежде всего, разбавленное изрядной долей эмпатии,
            рациональное мышление однозначно фиксирует необходимость новых
            предложений. Являясь всего лишь частью общей картины, независимые
            государства представлены в исключительно положительном свете.
          </PageListItem>
          <PageListItem>
            3.4. Повседневная практика показывает, что убеждённость некоторых
            оппонентов требует от нас анализа распределения внутренних резервов
            и ресурсов.
          </PageListItem>
        </PageList>
      </SectionContainer>
    </ContentWrapper>
  );
};

export default Agreement;
